docs: fix README formatting
